
{
  "/docs/meet-pieces": {
    "slug": "/docs/meet-pieces",
    "metadata": {
      "title": "👋 Meet Pieces",
      "description": "Welcome to Pieces! Your AI-powered productivity tool that captures, enriches, and reuses useful materials.",
      "sidebarTitle": null,
      "author": "Pieces Team",
      "lastModified": "2025-01-20",
      "order": 0
    },
    "content": "# 👋 Meet Pieces\n\nWelcome to Pieces! Your AI-powered productivity tool that captures, enriches, and reuses useful materials.\n\n## What is Pieces?\n\nPieces is an AI-powered productivity tool designed to capture, enrich, and reuse useful materials throughout your workflow. Whether you're a developer, designer, or knowledge worker, Pieces helps you save time and stay organized.\n\n## Key Features\n\n- **Smart Capture:** Save code snippets, screenshots, and text with automatic enrichment\n- **AI-Powered Search:** Find what you need using natural language queries\n- **Cross-Platform Sync:** Access your materials across all your devices\n- **IDE Integration:** Seamlessly work with your favorite development tools\n- **Team Collaboration:** Share knowledge and resources with your team\n\n## Getting Started\n\nThe best way to get started with Pieces is to install the desktop application and explore the fundamentals. From there, you can add integrations and customize your workflow.\n\n### Quick Links\n\n- [📖 Fundamentals](/docs/meet-pieces/fundamentals) - Learn the core concepts\n- [💻 Installation Guides](/docs/meet-pieces/installation-windows) - Get Pieces installed\n- [🚀 Quick Start](/docs/quick-guides/overview) - Jump right in\n- [🛠️ Desktop App](/docs/suite/desktop-app) - Explore the main application\n\n## Ready to Start?\n\nBegin your journey with Pieces by understanding the fundamentals and installing the application.\n\n[Get Started →](/docs/meet-pieces/fundamentals)",
    "lastModified": "2025-01-29T00:00:00.000Z"
  },
  "/docs/meet-pieces/fundamentals": {
    "slug": "/docs/meet-pieces/fundamentals",
    "metadata": {
      "title": "Core Features of Pieces",
      "description": "Learn about the [3] core features of Pieces, available for use within the Pieces for Developers Desktop App and any supported browser or IDE integration.",
      "sidebarTitle": "Fundamentals",
      "author": null,
      "lastModified": null,
      "order": null
    },
    "content": "---\n\n## The Pillars\n\nPieces powers developers to new levels of productivity by introducing the **[1] Long-Term Memory Engine (LTM-2)**, a powerful \"artificial memory\" that remembers your workflow and automatically saves context for future use.\n\n![](https://storage.googleapis.com/hashnode_product_documentation_assets/meet_pieces_assets/meet_pieces/fundamentals/ltm-2-header.png)\n\nNext, Pieces offers the **[2] Pieces Copilot**, assisting with day-to-day tasks like debugging code, generating comments, and answering questions—with as much or as little workflow context as you need.\n\nFinally, Pieces provides the **[3] Pieces Drive**, an intelligent and enriched material management experience that ensures your most important code—and other useful materials—are always at hand.\n\n## LTM-2\n\nThe Long-Term Memory Engine (LTM-2) captures live context from your workflow over a 7-day period, enhancing your ability to recall and access past materials.\n\n---\n\n_Pieces Copilot with LTM-2 Context_\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1734028488469/d128a760-7e91-4dbf-8cfc-e7fc257488b7.png?auto=compress,format&format=webp&q=75)\n\n---\n\nYou can ask questions like, \"_Can you provide me with the link to the Firestore database I was working in last week?_\" or \"_Summarize the contents of the brief on plugin updates in the Google doc Tim shared_\" for game-changing productivity enhancement.\n\nHere are some ways to take advantage of the LTM-2:\n\n- `Contextual Recall`: LTM-2 remembers the websites you visit, the code you work on, and the snippets you save. This context can be accessed via the Pieces Desktop App or within Copilot Chats inside your favorite IDE—with the relevant Pieces extension or plugin installed.\n- `Natural Language Queries`: Ask contextual questions about your previous workflow, and LTM-2 will source the relevant anchor and provide you with a clickable URL or path to a file on your device—or try asking it to summarize the contents of a webpage you visited earlier in the day.\n- `Integrated Access`: Utilize LTM-2 through the Pieces Desktop App or within your favorite development tools via browser or IDE integrations.\n\n### Workstream Activity\n\nPieces for Developers has just launched a new flagship feature called [Workstream Activity](https://docs.pieces.app/products/desktop/workstream-activity).\n\nThe Workstream Activity view in the [Pieces Desktop App](https://docs.pieces.app/products/desktop) uses the advanced Long-Term Memory (LTM-2) Engine to collect and summarize your recent tasks, discussions, code reviews, and more.\n\n---\n\n_Workstream Activity in the Pieces Desktop App_\n\n![](https://storage.googleapis.com/hashnode_product_documentation_assets/desktop_app_assets/workstream_activity/new_workstream_activity_media/ltm_rollup_demo_screenshot.png)\n\n---\n\n[PiecesOS](https://docs.pieces.app/products/core-dependencies/pieces-os) collects the LTM data and provides a concise roll-up of that data _every 20 minutes,_ drastically reducing the repetitive context-setting typical of many AI tools.\n\nEach roll-up is a snapshot that includes details on main tasks, projects, issues resolved, key decisions, discussions, documents, and code you've reviewed—often with helpful links included!\n\nYou can also start Pieces Copilot chats with individual roll-ups, eliminating the need to manually enter context.\n\n## Pieces Copilot\n\nPieces Copilot leverages advanced Large Language Models (LLMs) to assist you in understanding and generating code, accessible through your IDEs, editors, and the Desktop App.\n\n---\n\n_Pieces Copilot for Code Generation_\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1734028533289/f37f7075-f2d2-4a99-b948-c23fd70e7257.png?auto=compress,format&format=webp&q=75)\n\n---\n\nThe Pieces Copilot, accessible via the Pieces Desktop App or any of our IDE or browser integrations, helps with:\n\n- `Understanding Code`: Get explanations of complex code snippets, learn how a particular function works, or explore alternative implementations.\n- `Code Generation`: Generate code or code comments based on specific requirements, either from raw prompting or in-environment contextual understanding.\n- `LLM Flexibility`: Switch between local models for privacy and speed, or cloud-hosted models for more advanced capabilities.\n\n## Pieces Drive\n\nSaving and managing code and other materials is effortless and efficient with Pieces Drive.\n\n---\n\n_Viewing Saved Materials with Pieces Drive_\n\n![](https://cdn.hashnode.com/res/hashnode/image/upload/v1734026181487/e947ec50-4346-49f1-a967-62b218aafc47.png?auto=compress,format&format=webp&q=75)\n\n---\n\nThe Pieces Drive lets you save important developer resources, like notes, useful code, links, and more to your personal Local Repository—from which you can then view, edit, re-use, and share these materials via Pieces Shareable Links.\n\nIntended recipients are not required to have a Pieces account, so cross-platform collaboration is exceptionally easy.\n\nWith Pieces, you'll find Pieces Drive integrated into your favorite:\n\n- `IDEs and Editors`: Extensions for [VS Code](https://docs.pieces.app/products/extensions-plugins/visual-studio-code), [JetBrains IDEs](https://docs.pieces.app/products/extensions-plugins/jetbrains), [Sublime Text](https://docs.pieces.app/products/extensions-plugins/sublime), and more enable you to save snippets without leaving your coding environment.\n- `Web Browsers`: The Pieces Web Extension let you capture code from documentation sites, forums, or any web page using your favorite browsers.\n- `Collaboration Tools`: Integrations with tools like [Obsidian](https://docs.pieces.app/products/obsidian) help you save code from notes and shared documents.",
    "lastModified": "2025-01-29T00:00:00.000Z"
  }
}
